; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v12 ?v9)
             (pred_4 ?v13 ?v3)
             (pred_1 ?v12 ?v3)
             (pred_12 ?v7 ?v12 )
	     (pred_5 ?v12)
             (pred_10 ?v4)
             (pred_7 ?v13)
             (pred_3 ?v3)
             (pred_2 ?v12)
             (pred_11 ?v13)
             (pred_6 ?v12)
             (pred_8 ))



(:action op_3
:parameters (?v2 ?v5 ?v6 ?v1)
:precondition (and (pred_10 ?v2) (pred_10 ?v5) (pred_7 ?v6) (pred_3 ?v1)
          (pred_9 ?v2 ?v5) (pred_4 ?v6 ?v1)
                   (pred_1 ?v5 ?v1) (pred_5 ?v2) 
                   (pred_2 ?v5) (pred_11 ?v6))
:effect (and  (pred_6 ?v5) (not (pred_2 ?v5))))


(:action op_5
:parameters (?v2 ?v8)
:precondition (and (pred_10 ?v2) (pred_10 ?v8)
               (pred_5 ?v2) (pred_9 ?v2 ?v8) (pred_6 ?v8))
:effect (and (pred_5 ?v8) (not (pred_5 ?v2))))

(:action op_4
:parameters (?v2 ?v6)
:precondition (and (pred_10 ?v2) (pred_7 ?v6) 
                  (pred_5 ?v2) (pred_12 ?v6 ?v2) (pred_8 ))
:effect (and (pred_11 ?v6)
   (not (pred_12 ?v6 ?v2)) (not (pred_8 ))))


(:action op_1
:parameters (?v2 ?v10 ?v11)
:precondition (and (pred_10 ?v2) (pred_7 ?v10) (pred_7 ?v11)
                  (pred_5 ?v2) (pred_11 ?v11) (pred_12 ?v10 ?v2))
:effect (and (pred_11 ?v10) (pred_12 ?v11 ?v2)
        (not (pred_11 ?v11)) (not (pred_12 ?v10 ?v2))))

(:action op_2
:parameters (?v2 ?v6)
:precondition (and (pred_10 ?v2) (pred_7 ?v6) 
                  (pred_5 ?v2) (pred_11 ?v6))
:effect (and (pred_8 ) (pred_12 ?v6 ?v2) (not (pred_11 ?v6)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_18 obj_08 obj_26 obj_21 obj_11 obj_20 obj_28 obj_06 obj_29 obj_13 obj_05 obj_30 obj_03 obj_02 obj_22 obj_07 obj_01 obj_27 obj_17 obj_04 obj_25 obj_19 obj_15 obj_16 obj_24
    obj_09 obj_10
    obj_23 obj_14 obj_12
    )

    (:init
       (pred_8)

       (pred_10 obj_18)
       (pred_10 obj_08)
       (pred_10 obj_26)
       (pred_10 obj_21)
       (pred_10 obj_11)
       (pred_10 obj_20)
       (pred_10 obj_28)
       (pred_10 obj_06)
       (pred_10 obj_29)
       (pred_10 obj_13)
       (pred_10 obj_05)
       (pred_10 obj_30)
       (pred_10 obj_03)
       (pred_10 obj_02)
       (pred_10 obj_22)
       (pred_10 obj_07)
       (pred_10 obj_01)
       (pred_10 obj_27)
       (pred_10 obj_17)
       (pred_10 obj_04)
       (pred_10 obj_25)
       (pred_10 obj_19)
       (pred_10 obj_15)
       (pred_10 obj_16)
       (pred_10 obj_24)
       (pred_3 obj_09)
       (pred_3 obj_10)
       (pred_7 obj_23)
       (pred_7 obj_14)
       (pred_7 obj_12)

       (pred_9 obj_18 obj_20)
       (pred_9 obj_18 obj_08)
       (pred_9 obj_08 obj_28)
       (pred_9 obj_08 obj_26)
       (pred_9 obj_08 obj_18)
       (pred_9 obj_26 obj_06)
       (pred_9 obj_26 obj_21)
       (pred_9 obj_26 obj_08)
       (pred_9 obj_21 obj_29)
       (pred_9 obj_21 obj_11)
       (pred_9 obj_21 obj_26)
       (pred_9 obj_11 obj_13)
       (pred_9 obj_11 obj_21)
       (pred_9 obj_20 obj_05)
       (pred_9 obj_20 obj_28)
       (pred_9 obj_20 obj_18)
       (pred_9 obj_28 obj_30)
       (pred_9 obj_28 obj_06)
       (pred_9 obj_28 obj_08)
       (pred_9 obj_28 obj_20)
       (pred_9 obj_06 obj_03)
       (pred_9 obj_06 obj_29)
       (pred_9 obj_06 obj_26)
       (pred_9 obj_06 obj_28)
       (pred_9 obj_29 obj_02)
       (pred_9 obj_29 obj_13)
       (pred_9 obj_29 obj_21)
       (pred_9 obj_29 obj_06)
       (pred_9 obj_13 obj_22)
       (pred_9 obj_13 obj_11)
       (pred_9 obj_13 obj_29)
       (pred_9 obj_05 obj_07)
       (pred_9 obj_05 obj_30)
       (pred_9 obj_05 obj_20)
       (pred_9 obj_30 obj_01)
       (pred_9 obj_30 obj_03)
       (pred_9 obj_30 obj_28)
       (pred_9 obj_30 obj_05)
       (pred_9 obj_03 obj_27)
       (pred_9 obj_03 obj_02)
       (pred_9 obj_03 obj_06)
       (pred_9 obj_03 obj_30)
       (pred_9 obj_02 obj_17)
       (pred_9 obj_02 obj_22)
       (pred_9 obj_02 obj_29)
       (pred_9 obj_02 obj_03)
       (pred_9 obj_22 obj_04)
       (pred_9 obj_22 obj_13)
       (pred_9 obj_22 obj_02)
       (pred_9 obj_07 obj_25)
       (pred_9 obj_07 obj_01)
       (pred_9 obj_07 obj_05)
       (pred_9 obj_01 obj_19)
       (pred_9 obj_01 obj_27)
       (pred_9 obj_01 obj_30)
       (pred_9 obj_01 obj_07)
       (pred_9 obj_27 obj_15)
       (pred_9 obj_27 obj_17)
       (pred_9 obj_27 obj_03)
       (pred_9 obj_27 obj_01)
       (pred_9 obj_17 obj_16)
       (pred_9 obj_17 obj_04)
       (pred_9 obj_17 obj_02)
       (pred_9 obj_17 obj_27)
       (pred_9 obj_04 obj_24)
       (pred_9 obj_04 obj_22)
       (pred_9 obj_04 obj_17)
       (pred_9 obj_25 obj_19)
       (pred_9 obj_25 obj_07)
       (pred_9 obj_19 obj_15)
       (pred_9 obj_19 obj_01)
       (pred_9 obj_19 obj_25)
       (pred_9 obj_15 obj_16)
       (pred_9 obj_15 obj_27)
       (pred_9 obj_15 obj_19)
       (pred_9 obj_16 obj_24)
       (pred_9 obj_16 obj_17)
       (pred_9 obj_16 obj_15)
       (pred_9 obj_24 obj_04)
       (pred_9 obj_24 obj_16)
       (pred_2 obj_27)
       (pred_2 obj_22)
       (pred_2 obj_20)
       (pred_1  obj_27 obj_09)
       (pred_1  obj_22 obj_10)
       (pred_1  obj_20 obj_09)
       (pred_6 obj_18)
       (pred_6 obj_08)
       (pred_6 obj_26)
       (pred_6 obj_21)
       (pred_6 obj_11)
       (pred_6 obj_28)
       (pred_6 obj_06)
       (pred_6 obj_29)
       (pred_6 obj_13)
       (pred_6 obj_05)
       (pred_6 obj_30)
       (pred_6 obj_03)
       (pred_6 obj_02)
       (pred_6 obj_07)
       (pred_6 obj_01)
       (pred_6 obj_17)
       (pred_6 obj_04)
       (pred_6 obj_25)
       (pred_6 obj_19)
       (pred_6 obj_15)
       (pred_6 obj_16)
       (pred_6 obj_24)

       (pred_4  obj_23 obj_09)
       (pred_4  obj_14 obj_10)
       (pred_4  obj_12 obj_09)
       (pred_12 obj_23 obj_28)
       (pred_12 obj_14 obj_24)
       (pred_12 obj_12 obj_30)
       (pred_5 obj_29)
    )

    (:goal (and
       (pred_12 obj_14 obj_28)
       (pred_12 obj_12 obj_24)
    ))
(:constraints
  (always (not (pred_5 obj_02)))
)
)

; plan
1. (op_5 obj_29 obj_06)
   deleted: (pred_5 obj_29)
   added: (pred_5 obj_06)
   goals met: 0 of 2
2. (op_5 obj_06 obj_28)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_28)
   goals met: 0 of 2
3. (op_5 obj_28 obj_30)
   deleted: (pred_5 obj_28)
   added: (pred_5 obj_30)
   goals met: 0 of 2
4. (op_4 obj_30 obj_12)
   deleted: (pred_12 obj_12 obj_30) (pred_8)
   added: (pred_11 obj_12)
   goals met: 0 of 2
5. (op_5 obj_30 obj_01)
   deleted: (pred_5 obj_30)
   added: (pred_5 obj_01)
   goals met: 0 of 2
6. (op_5 obj_01 obj_19)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_19)
   goals met: 0 of 2
7. (op_5 obj_19 obj_15)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_15)
   goals met: 0 of 2
8. (op_5 obj_15 obj_16)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_16)
   goals met: 0 of 2
9. (op_5 obj_16 obj_24)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_24)
   goals met: 0 of 2
10. (op_1 obj_24 obj_14 obj_12)
   deleted: (pred_11 obj_12) (pred_12 obj_14 obj_24)
   added: (pred_11 obj_14) (pred_12 obj_12 obj_24)
   goals met: 1 of 2
11. (op_5 obj_24 obj_16)
   deleted: (pred_5 obj_24)
   added: (pred_5 obj_16)
   goals met: 1 of 2
12. (op_5 obj_16 obj_15)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_15)
   goals met: 1 of 2
13. (op_5 obj_15 obj_19)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_19)
   goals met: 1 of 2
14. (op_5 obj_19 obj_01)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_01)
   goals met: 1 of 2
15. (op_5 obj_01 obj_30)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_30)
   goals met: 1 of 2
16. (op_5 obj_30 obj_28)
   deleted: (pred_5 obj_30)
   added: (pred_5 obj_28)
   goals met: 1 of 2
17. (op_1 obj_28 obj_23 obj_14)
   deleted: (pred_11 obj_14) (pred_12 obj_23 obj_28)
   added: (pred_11 obj_23) (pred_12 obj_14 obj_28)
   goals met: 2 of 2
